In [1]:
import numpy as np
import pandas as pd

**문제1 : 학생들의 중간, 기말 고사 성적만으로 '총점'과 '평점' 추가하기**

In [2]:
friend_dict_list = [{'이름': '나학생1', '중간고사점수': 95, '기말고사점수': 85},
                    {'이름': '나학생2', '중간고사점수': 85, '기말고사점수': 80},
                    {'이름': '나학생3', '중간고사점수': 10, '기말고사점수': 30}]

In [3]:
df = pd.DataFrame(friend_dict_list)
df

     이름  중간고사점수  기말고사점수
0  나학생1      95      85
1  나학생2      85      80
2  나학생3      10      30

In [12]:
df['총점'] = df['중간고사점수'] + df['기말고사점수']
df

     이름  중간고사점수  기말고사점수   총점
0  나학생1      95      85  180
1  나학생2      85      80  165
2  나학생3      10      30   40

In [13]:
df['평균'] = df['총점']/2
df

     이름  중간고사점수  기말고사점수   총점    평균
0  나학생1      95      85  180  90.0
1  나학생2      85      80  165  82.5
2  나학생3      10      30   40  20.0

In [16]:
# 단순 컬럼명만 반복해서 출력
for i in df.columns:
    print(i)

이름
중간고사점수
기말고사점수
총점
평균

In [20]:
for i in df:
    print(i, type(i))

이름 <class 'str'>
중간고사점수 <class 'str'>
기말고사점수 <class 'str'>
총점 <class 'str'>
평균 <class 'str'>

In [24]:
# DataFrame에 row별 반환 해서 활용
# iterrows(): DataFrame의 내부 데이터를 반복해서 하나씩 반환할 수 있는 반복 기능의 API 사용
for v in df.iterrows():
    print(v, type(v))

(0, 이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object) <class 'tuple'>
(1, 이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object) <class 'tuple'>
(2, 이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object) <class 'tuple'>

In [30]:
# DateFrame의 데이터들을 하나하나 도출하기 위해서는 iterrows()를 활용해서 index를 key, column명을 기준으로 한 row 단위로 착출.
# iterrows() 미사용 시 컬럼명만 도출
# https://pandas.pydata.org/pandas-docs/stable/reference/series.html  ------   API 참고

for k, v in df.iterrows():
    print(k, '', v, type(v), sep='\n')

0

이름        나학생1
중간고사점수      95
기말고사점수      85
총점         180
평균          90
Name: 0, dtype: object
<class 'pandas.core.series.Series'>
1

이름        나학생2
중간고사점수      85
기말고사점수      80
총점         165
평균        82.5
Name: 1, dtype: object
<class 'pandas.core.series.Series'>
2

이름        나학생3
중간고사점수      10
기말고사점수      30
총점          40
평균          20
Name: 2, dtype: object
<class 'pandas.core.series.Series'>

**문제2 : DataFrame도 반복문으로 처리 가능 평균값을 반복문(for) 활용해서 출력해 보기**

In [33]:
for i in df['평균']:
    print(i)

90.0
82.5
20.0

**문제3 : grade(등급) 이라는 컬럼 추가, 90점이상(A), 80점이상(B), 그외 F등급 조건식 활용해서 파이썬 코드로 처리해 보기**

In [40]:
grade = []

for i in df['평균']:
    if i >= 90:
        grade.append('A')
    elif i >= 80:
        grade.append('B')
    else:
        grade.append('F')

grade

['A', 'B', 'F']

In [43]:
df['grade'] = grade
df

     이름  중간고사점수  기말고사점수   총점    평균 grade
0  나학생1      95      85  180  90.0     A
1  나학생2      85      80  165  82.5     B
2  나학생3      10      30   40  20.0     F

**문제4:'이수여부'라는 컬럼을 추가하되 등급을 기준으로 F인 경우 fail/F가 아닌 경우 pass 값으로 반영 단 lambda 문법으로 처리해 보기**

In [ ]:
pf = []

for i in df.grade:
    if i == 'F':
        pf.append('fail')
    else:
        pf.append('pass')
        
[i for i in df.grade 'fail' if i == 'F' else pf.]

In [45]:
# apply() : 함수 호출 및 람다식적용 시 사용하는 표현.
# 함수를 호출하는 시리즈 객체에 존재하는 모든 row 수만큼 알아서 적용 = 반복문 없이도 함수 호출
# 조건식 적용시 if 조건식이 true인 경우 처리 로직은(반환값) if 키워드 앞단에 명시

'''
lambda식 이해를 위한 임시 함수 구현ㄴ
def lambda(grade):
    if grade != 'F':
        return 'pass'
    else:
        return 'fail'
'''

# lambda식으로 변환

df['이수여부'] = df['grade'].apply(lambda grade : 'pass' if grade != 'F' else 'fail')

df

     이름  중간고사점수  기말고사점수   총점    평균 grade  이수여부
0  나학생1      95      85  180  90.0     A  pass
1  나학생2      85      80  165  82.5     B  pass
2  나학생3      10      30   40  20.0     F  fail

In [47]:
x = lambda a, b : 'pass' if a * b >= 30 else 'fail'


print(x(3, 5))
print(x(7, 9))

fail
pass

**문제5: apply 함수를 사용해서 년월일 정보에서 년에 해당하는 정보만 반환**

apply() 특징

1. pandas.core.series.Series 제공하는 함수
2. 주로 람다식 적용해서 사용
3. 사용자 정의 함수도 적용
4. 함수명이 parameter로 반영, 호출하고자 하는 함수의 parameter개수만큼 추가로 적용 가능
5. **호출 횟수는 Serise가 보유한 row수 데이터 수 만큼 자동 호출**
6. 내부 로직 : 반복 로직 포함

In [48]:
date_list = [{'yyyy-mm-dd': '2000-06-27'},
             {'yyyy-mm-dd': '2002-09-24'},
             {'yyyy-mm-dd': '2018-12-20'}]

df = pd.DataFrame(date_list)
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2018-12-20

In [49]:
df['yyyy-mm-dd']
print(type)

0    2000-06-27
1    2002-09-24
2    2018-12-20
Name: yyyy-mm-dd, dtype: object

In [50]:
# 하나의 문자열에서 하이픈 기준으로 문자열들로 구성된 list로 변환
# 하이픈 기준으로 나뉜 데이터를 토큰이라 부름. 더 이상 나눠질 수 없는 의미있는 단어들

v = '2000-06-27'.split('-')
v

['2000', '06', '27']

In [52]:
for v in df['yyyy-mm-dd']:
    print(v)

2000-06-27
2002-09-24
2018-12-20

In [54]:
# 연도만 출력
# split() 이용
for v in df['yyyy-mm-dd']:
    print(v.split('-')[0])

2000
2002
2018

In [55]:
# slicing으로 yyyy값만 도출
for v in df['yyyy-mm-dd']:
    print(v[0:4])

2000
2002
2018

In [56]:
# apply() + 사용자 정의 함수 활용 학습
# 연도만 반환하는 사용자 정의 함수
def get_year(row):    # yyyy-mm-dd 포맷으로 파라미터가 유입된다 가정
    return row[0:4]

print(get_year('yyyy-mm-dd'))

yyyy

In [61]:
#  df['yyyy-mm-dd']: 시리즈
# df['yyyy-mm-dd'].apply(): 시리즈 내에 저장된 데이터 row수만큼 함수 호출 + 시리즈 내에 저장된 데이터를 apply 함수 영역의 파라미터에 제공

df['year'] = df['yyyy-mm-dd'].apply(get_year)
del df['age']
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2018-12-20  2018

**문제 6 : gender별로 그룹화 하기**

In [63]:
student_list = [{'name': 'John', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Nate', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Abraham', 'major': "Physics", 'gender': "male"},
                {'name': 'Brian', 'major': "Psychology", 'gender': "male"},
                {'name': 'Janny', 'major': "Economics", 'gender': "female"},
                {'name': 'Yuna', 'major': "Economics", 'gender': "female"},
                {'name': 'Jeniffer', 'major': "Computer Science", 'gender': "female"},
                {'name': 'Edward', 'major': "Computer Science", 'gender': "male"},
                {'name': 'Zara', 'major': "Psychology", 'gender': "female"},
                {'name': 'Wendy', 'major': "Economics", 'gender': "female"},
                {'name': 'Sera', 'major': "Psychology", 'gender': "female"}
                ]
df = pd.DataFrame(student_list, columns=['name', 'major', 'gender'])
df

        name             major  gender
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Janny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy         Economics  female
10      Sera        Psychology  female

In [67]:
# sql의 group by 절과 유사
# select gender from DataFrame group by gender

dg = df.groupby('gender')
dg.size()    # size(): 그룹별 개수를 확인하는 함수

gender
female    6
male      5
dtype: int64

In [68]:
# 그룹에 속한 index 확인
dg.groups

{'female': [4, 5, 6, 8, 9, 10], 'male': [0, 1, 2, 3, 7]}

In [69]:
type(dg.groups)

pandas.io.formats.printing.PrettyDict

In [70]:
# 그룹별로 데이터를 하나씩 도출하는 문법

mg = df.groupby('major')
mg.size()

major
Computer Science    4
Economics           3
Physics             1
Psychology          3
dtype: int64

In [75]:
# 그룹별 index를 list 형식으로 반환
mg.groups

{'Computer Science': [0, 1, 6, 7], 'Economics': [4, 5, 9], 'Physics': [2], 'Psychology': [3, 8, 10]}

In [73]:
# 그룹별 상세 정보 확인 가능한 코드 
# k = index name
for k, v in mg:
    print(k, '\n', v)
    print('---' * 10)

Computer Science
        name             major  gender
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male
------------------------------
Economics
     name      major  gender
4  Janny  Economics  female
5   Yuna  Economics  female
9  Wendy  Economics  female
------------------------------
Physics
       name    major gender
2  Abraham  Physics   male
------------------------------
Psychology
      name       major  gender
3   Brian  Psychology    male
8    Zara  Psychology  female
10   Sera  Psychology  female
------------------------------

In [76]:
# 각 그룹별 사이즈 정보로 새로운 DataFrame 생성(데이터 활용도 극대화)
# RDBMS 관점에선 새로운 테이블 생성.
df1 = pd.DataFrame(mg.size())
df1

# 아쉬운 점: 컬럼명이 0 -> 개선 필요

                  0
major
Computer Science  4
Economics         3
Physics           1
Psychology        3

In [77]:
# DataFrame 생성 시 컬럼명을 부여해서 생성
df1 = pd.DataFrame({'count': mg.size()})
df1

# 아쉬운 점: 컬럼명이 두 개의 row로 표현됨

                  count
major
Computer Science      4
Economics             3
Physics               1
Psychology            3

In [78]:
# 생성되는 DataFrame의 컬럼명 위치 재정리
# reset_index(): 컬럼명 재정리하는 주요한 함수
df1 = pd.DataFrame({'count': mg.size()}).reset_index()
df1

              major  count
0  Computer Science      4
1         Economics      3
2           Physics      1
3        Psychology      3

In [79]:
gender = pd.DataFrame({'count': dg.size()}).reset_index()
gender

   gender  count
0  female      6
1    male      5